#include "stdafx.h"
#include "mydb_log.h"

#ifndef _MYDB_LOG_LOW_H_
#define _MYDB_LOG_LOW_H_
//-------------------------------------------------------------------------------------------------------------
/* Журнал (Write Ahead Log) содержит историю изменения блоков базы данных */
typedef struct Logging sLog;
struct Logging
{
  const char  *filename;
  HFILE        fd;
  //------------------
  uint64_t    lsn;
  uint_t      n_recover;
};
/*   Каждая запись в журнале содержит № записи (LSN) — монотонно увеличивающийся
 *   счётчик записи, тип операции (insert / replace / delete), пару ключ-значение
 *   либо только ключ (для delete).
 *   Также в журнале необходимо иметь специальные записи для событий: checkpoint,
 *   открытия и закрытия базы данных. Формат этих записей определяется отдельно.
 *
 *      +------+-------+-----+-----+-----+-----+----------+
 *      | type |  LSN  | ksz | vsz | key | val | LogRecSz | values
 *      +------+-------+-----+-----+-----+-----+----------+
 *      | char | int64 |int32|int32| ksz | vsz | uint32_t | sizes
 *      +------+-------+-----+-----+-----+-----+----------+
 */
//-------------------------------------------------------------------------------------------------------------
typedef struct LogRecord sLogRec;
struct LogRecord
{
  mydb_log_enum  type;  // type of operation
  uint64_t        lsn;
  //------------------
  sDBT       key, val;
  //------------------
  uint32_t       size;
};
//-------------------------------------------------------------------------------------------------------------
/* Записать в журнал log record. */
bool      mydb_log_write (IN sLog *log, IN sLogRec *record);
/* Поместить позицию чтения на последний чекпоинт журнала */
bool      mydb_log_seek (IN sLog *log);
//-------------------------------------------------------------------------------------------------------------
/* Прочитать текущую запись из журнала и сместить позицию чтения */
sLogRec*  mydb_log_record_next (IN sLog    *log);
void      mydb_log_record_free (IN sLogRec *record);
//-------------------------------------------------------------------------------------------------------------
#ifdef _DEBUG_LOG
void  mydb_log_print (IN sLog *log, sLogRec *record);
#endif // _DEBUG_LOG
//-------------------------------------------------------------------------------------------------------------
#endif // _MYDB_LOG_LOW_H_
